{
    "Morning Adhkar": [
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "When you say this in the morning, you have fulfilled your gratitude for the day",
            "reference": "Abu Dawud",
            "content": "O Allah, by You we enter the morning and by You we enter the evening, by You we live and by You we die, and to You is the resurrection"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Whoever says this with conviction in the morning and dies that night will enter Paradise",
            "reference": "Bukhari",
            "content": "O Allah, You are my Lord, there is none worthy of worship except You. You created me and I am Your servant, and I am faithful to my covenant and promise to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for indeed none can forgive sins except You"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "Whoever says this in the morning and evening, it becomes incumbent upon Allah to please him on the Day of Resurrection",
            "reference": "Abu Dawud",
            "content": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet"
        },
        {
            "category": "Morning Adhkar",
            "count": "4",
            "description": "Whoever says this in the morning or evening, Allah will free him from the Fire",
            "reference": "Abu Dawud",
            "content": "O Allah, I have reached the morning and I call upon You, and I call upon the bearers of Your Throne, Your angels, and all of Your creation to witness that You are Allah, there is no deity except You, alone without partner, and that Muhammad is Your servant and messenger"
        },
        {
            "category": "Morning Adhkar",
            "count": "7",
            "description": "Whoever says this, Allah will suffice him against his concerns in this world and the next",
            "reference": "Abu Dawud",
            "content": "Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "Nothing will harm him on that day, and in another narration: no sudden calamity will befall him",
            "reference": "Abu Dawud",
            "content": "In the name of Allah, with Whose name nothing can harm on earth or in heaven, and He is the Hearing, the Knowing"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Comprehensive morning dua seeking good and protection from evil",
            "reference": "Muslim",
            "content": "We have reached the morning and at this very time the dominion belongs to Allah. All praise is for Allah. None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this day and the good of what follows it, and I seek refuge in You from the evil of this day and the evil of what follows it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from torment in the Fire and punishment in the grave"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "Equivalent to the number of Allah's creation, His pleasure, the weight of His Throne, and the extent of His words",
            "reference": "Muslim",
            "content": "Glory be to Allah and praise be to Him, by the multitude of His creation, by His pleasure, by the weight of His Throne, and by the extent of His words"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "Seeking well-being for body, hearing, and sight, and protection from disbelief, poverty, and grave torment",
            "reference": "Abu Dawud",
            "content": "O Allah, grant me well-being in my body, O Allah, grant me well-being in my hearing, O Allah, grant me well-being in my sight, there is none worthy of worship except You. O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave, there is none worthy of worship except You"
        },
        {
            "category": "Morning Adhkar",
            "count": "100",
            "description": "It will be equal to freeing ten slaves, and one hundred good deeds will be written for him, and one hundred bad deeds will be erased from him, and it will be a protection for him from Satan",
            "reference": "Muslim",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Allah will assign a guardian for you and Satan will not come near you",
            "reference": "Quran 2:255",
            "content": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say, He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say: I seek refuge in the Lord of daybreak, From the evil of that which He created, And from the evil of darkness when it settles, And from the evil of the blowers in knots, And from the evil of an envier when he envies"
        },
        {
            "category": "Morning Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say: I seek refuge in the Lord of mankind, The Sovereign of mankind, The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind"
        },
        {
            "category": "Morning Adhkar",
            "count": "10",
            "description": "Blessings upon the Prophet - Whoever sends blessings upon me ten times, Allah will send blessings upon him one hundred times",
            "reference": "Muslim",
            "content": "O Allah, send prayers and peace and blessings upon our Prophet Muhammad"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Whoever says this in the morning has fulfilled his gratitude for that day",
            "reference": "Abu Dawud",
            "content": "O Allah, whatever blessing I or any of Your creation have reached this morning, it is from You alone, without partner, so for You is all praise and all thanks"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Whoever says this, Allah will protect him from all directions",
            "reference": "Abu Dawud",
            "content": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Rectify all my affairs and do not leave me to my soul for the blink of an eye",
            "reference": "An-Nasa'i",
            "content": "O Ever-Living, O Self-Sustaining, by Your mercy I seek help, rectify all my affairs and do not leave me to my soul for the blink of an eye"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Comprehensive morning supplication seeking refuge from various evils",
            "reference": "Bukhari",
            "content": "O Allah, I seek refuge in You from worry and grief, and I seek refuge in You from incapacity and laziness, and I seek refuge in You from cowardice and miserliness, and I seek refuge in You from being overcome by debt and overpowered by men"
        },
        {
            "category": "Morning Adhkar",
            "count": "1",
            "description": "Seeking blessing in sustenance, well-being, and guidance",
            "reference": "Ibn Hibban",
            "content": "O Allah, bless us in what You have provided for us, grant us well-being and guidance, and be for us and not against us"
        }
    ],
    "Evening Adhkar": [
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Comprehensive evening dhikr seeking good of the night and protection from evil",
            "reference": "Muslim",
            "content": "We have reached the evening and at this very time the dominion belongs to Allah. All praise is for Allah. None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it, and I seek refuge in You from the evil of this night and the evil of what follows it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from torment in the Fire and punishment in the grave"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Whoever says this in the morning and evening and dies that night, he will enter Paradise",
            "reference": "Bukhari",
            "content": "O Allah, You are my Lord, there is none worthy of worship except You. You created me and I am Your servant, and I am faithful to my covenant and promise to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for indeed none can forgive sins except You"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "Whoever says this in the morning and evening, it becomes incumbent upon Allah to please him on the Day of Resurrection",
            "reference": "Abu Dawud",
            "content": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Whoever says this in the evening has fulfilled his gratitude for that day",
            "reference": "Abu Dawud",
            "content": "O Allah, whatever blessing has reached me or anyone of Your creation, it is from You alone, You have no partner, so for You is all praise and for You is all gratitude"
        },
        {
            "category": "Evening Adhkar",
            "count": "7",
            "description": "Whoever says this, Allah will suffice him against his concerns in this world and the next",
            "reference": "Abu Dawud",
            "content": "Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "Nothing will harm him that day, and in another narration: no sudden calamity will befall him",
            "reference": "Abu Dawud",
            "content": "In the name of Allah, with Whose name nothing can harm on earth or in heaven, and He is the Hearing, the Knowing"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "Equivalent to the number of Allah's creation, His pleasure, the weight of His Throne, and the extent of His words",
            "reference": "Muslim",
            "content": "Glory be to Allah and praise be to Him, by the multitude of His creation, by His pleasure, by the weight of His Throne, and by the extent of His words"
        },
        {
            "category": "Evening Adhkar",
            "count": "100",
            "description": "It will be equal to freeing ten slaves, and one hundred good deeds will be written for him, and one hundred bad deeds will be erased from him, and it will be a protection for him from Satan",
            "reference": "Muslim",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Ayat al-Kursi - Protection from Satan until morning",
            "reference": "Bukhari",
            "content": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say, He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say: I seek refuge in the Lord of daybreak, From the evil of that which He created, And from the evil of darkness when it settles, And from the evil of the blowers in knots, And from the evil of an envier when he envies"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "It will suffice you against everything",
            "reference": "Bukhari",
            "content": "Say: I seek refuge in the Lord of mankind, The Sovereign of mankind, The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind"
        },
        {
            "category": "Evening Adhkar",
            "count": "10",
            "description": "Blessings upon the Prophet - Whoever sends blessings upon me ten times, Allah will send blessings upon him one hundred times",
            "reference": "Muslim",
            "content": "O Allah, send prayers and peace and blessings upon our Prophet Muhammad"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "We have reached the evening upon the fitrah of Islam",
            "reference": "Muslim",
            "content": "We have reached the evening upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad (peace be upon him), and upon the religion of our father Ibrahim, a Muslim and of true faith, and he was not of the polytheists"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Whoever says this, Allah will protect him from all directions",
            "reference": "Abu Dawud",
            "content": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth"
        },
        {
            "category": "Evening Adhkar",
            "count": "3",
            "description": "Seeking well-being for body, hearing, and sight, and protection from disbelief, poverty, and grave torment",
            "reference": "Abu Dawud",
            "content": "O Allah, grant me well-being in my body, O Allah, grant me well-being in my hearing, O Allah, grant me well-being in my sight, there is none worthy of worship except You. O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave, there is none worthy of worship except You"
        },
        {
            "category": "Evening Adhkar",
            "count": "1",
            "description": "Rectify all my affairs and do not leave me to my soul for the blink of an eye",
            "reference": "An-Nasa'i",
            "content": "O Ever-Living, O Self-Sustaining, by Your mercy I seek help, rectify all my affairs and do not leave me to my soul for the blink of an eye"
        }
    ],
    "Post-Prayer Azkar": [
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Seeking forgiveness three times then the Greatest Peace - The Prophet ﷺ used to seek forgiveness three times after finishing his prayer, then say this supplication",
            "reference": "Muslim",
            "content": "I seek forgiveness from Allah, I seek forgiveness from Allah, I seek forgiveness from Allah. O Allah, You are Peace and from You is peace, blessed are You, O Possessor of majesty and honor"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Complete declaration of monotheism with supplication for wealth and protection from poverty - A blessed supplication combining monotheism and seeking Allah's assistance",
            "reference": "Agreed upon",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Allah, none can withhold what You give and none can give what You withhold, and the fortune of a fortunate one cannot benefit him against You"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "33",
            "description": "Glorification, praise, and magnification - Whoever glorifies Allah thirty-three times, praises Allah thirty-three times, and magnifies Allah thirty-three times, that makes ninety-nine, then completes the hundred by saying: None has the right to be worshipped except Allah alone, without partner, to Him belongs sovereignty and praise, and He is over all things omnipotent - his sins will be forgiven even if they are like the foam of the sea",
            "reference": "Muslim",
            "content": "Glory be to Allah (33), and praise be to Allah (33), and Allah is the Greatest (33)"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Completion of the hundred with declaration of monotheism - This is the hundredth that completes the glorification, praise and magnification, and with it sins are forgiven even if they are like the foam of the sea",
            "reference": "Muslim",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "10",
            "description": "Ten times after Maghrib and Fajr - Whoever says this ten times after Maghrib and Fajr prayers, ten good deeds are written for him for each one, ten sins are erased, and he is raised ten degrees, and he is protected from Satan",
            "reference": "Ahmad and At-Tirmidhi",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise, He gives life and causes death and He is over all things omnipotent"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Special supplication after Fajr prayer - The Prophet ﷺ used to say this supplication specifically after Fajr prayer to ask for beneficial knowledge, good provision, and accepted deeds",
            "reference": "Ibn Majah",
            "content": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "7",
            "description": "Seven times after Fajr and Maghrib for protection from the Fire - Whoever says this seven times after Fajr or Maghrib prayer and dies on that day or night, it will be protection from the Fire for him",
            "reference": "Abu Dawud",
            "content": "O Allah, protect me from the Fire"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Supplication for assistance in remembrance, gratitude and excellent worship - The Prophet ﷺ taught this to Mu'adh ibn Jabal and told him: O Mu'adh, do not fail to say this supplication after every prayer",
            "reference": "Abu Dawud and An-Nasa'i",
            "content": "O Allah, help me to remember You, to thank You, and to worship You in the best manner"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Ayat al-Kursi - Whoever recites it after every obligatory prayer, nothing will prevent him from entering Paradise except death, and it is the greatest verse in the Book of Allah",
            "reference": "An-Nasa'i and At-Tabarani",
            "content": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "3",
            "description": "Surah Al-Ikhlas three times - Equivalent to one-third of the Qur'an in reward, and reciting it three times after each prayer brings blessings and protection",
            "reference": "Bukhari",
            "content": "Say, He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "3",
            "description": "Surah Al-Falaq three times - One of the protective chapters that guard against the evil of what Allah has created and against sorcerers and the envious, and reciting it after prayer brings protection and safety",
            "reference": "Abu Dawud and At-Tirmidhi",
            "content": "Say: I seek refuge in the Lord of daybreak, From the evil of that which He created, And from the evil of darkness when it settles, And from the evil of the blowers in knots, And from the evil of an envier when he envies"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "3",
            "description": "Surah An-Nas three times - Protects from the whispers of devils and from the evil of jinn and mankind, and it is the final of the protective chapters that the Prophet ﷺ used to recite after each prayer",
            "reference": "Abu Dawud and At-Tirmidhi",
            "content": "Say: I seek refuge in the Lord of mankind, The Sovereign of mankind, The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind"
        },
        {
            "category": "Post-Prayer Azkar",
            "count": "1",
            "description": "Comprehensive supplication for purification from sins and transgressions - A great supplication for purifying from all sins and disobedience, the Prophet ﷺ used to supplicate with it to purify the heart and soul",
            "reference": "Bukhari and Muslim",
            "content": "O Allah, distance me from my sins just as You have distanced the East from the West, O Allah, purify me from my sins as a white robe is purified from filth, O Allah, cleanse me from my sins with snow, water, and ice"
        }
    ],
    "Tasbeeh": [
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "One thousand good deeds will be written for him or one thousand bad deeds will be erased from him",
            "reference": "Muslim",
            "content": "Glory be to Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "His sins will be erased even if they were like the foam of the sea",
            "reference": "Muslim",
            "content": "Glory be to Allah and praise be to Him"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "They are heavy in the scales and beloved to the Most Merciful",
            "reference": "Bukhari & Muslim",
            "content": "Glory be to Allah and praise be to Him, Glory be to Allah, the Most Great"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "A palm tree will be planted for him in Paradise",
            "reference": "At-Tirmidhi & Ibn Majah",
            "content": "Glory be to Allah, the Most Great, and praise be to Him"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "They will fill what is between the heavens and the earth",
            "reference": "Muslim",
            "content": "Glory be to Allah and praise be to Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "It will be equal to freeing ten slaves, and one hundred good deeds will be written for him, and one hundred bad deeds will be erased from him",
            "reference": "Bukhari & Muslim",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "A great word that fills the scales",
            "reference": "Muslim & At-Tirmidhi",
            "content": "All praise is for Allah, Lord of the worlds"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "A treasure from the treasures of Paradise",
            "reference": "Bukhari & Muslim",
            "content": "There is no might and no power except with Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "The most beloved words to Allah Almighty",
            "reference": "Muslim",
            "content": "Allah is the Greatest"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "Whoever says this one hundred times in a day, it will be a protection from Satan for that day",
            "reference": "Bukhari & Muslim",
            "content": "There is no god but Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "Whoever sends blessings upon the Prophet ten times, Allah will send blessings upon him one hundred times",
            "reference": "Muslim",
            "content": "O Allah, send prayers and peace and blessings upon our Prophet Muhammad"
        },
        {
            "category": "Tasbeeh",
            "count": "100",
            "description": "The Prophet (peace be upon him) used to seek forgiveness from Allah more than seventy times a day",
            "reference": "Bukhari",
            "content": "I seek forgiveness from Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "33",
            "description": "Whoever glorifies Allah after every prayer thirty-three times",
            "reference": "Muslim",
            "content": "Glory be to Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "33",
            "description": "Whoever praises Allah after every prayer thirty-three times",
            "reference": "Muslim",
            "content": "All praise is for Allah"
        },
        {
            "category": "Tasbeeh",
            "count": "34",
            "description": "Whoever magnifies Allah after every prayer thirty-four times, his sins will be forgiven even if they were like the foam of the sea",
            "reference": "Muslim",
            "content": "Allah is the Greatest"
        },
        {
            "category": "Tasbeeh",
            "count": "10",
            "description": "The best remembrance is 'There is no god but Allah'",
            "reference": "At-Tirmidhi & Ibn Majah",
            "content": "There is no god but Allah, alone, without any partner"
        },
        {
            "category": "Tasbeeh",
            "count": "10",
            "description": "The supplication of Dhun-Nun (Jonah) which he made while in the belly of the whale",
            "reference": "At-Tirmidhi & Al-Hakim",
            "content": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers"
        },
        {
            "category": "Tasbeeh",
            "count": "10",
            "description": "Whoever says this ten times, it is as if he freed four souls from the descendants of Ishmael",
            "reference": "Bukhari & Muslim",
            "content": "There is no god but Allah, alone, without any partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent"
        }
    ],
    "Azkar Before Sleep": [
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Basic bedtime dhikr",
            "reference": "Bukhari",
            "content": "In Your name, my Lord, I lie down and in Your name I rise, so if You should take my soul then have mercy upon it, and if You should return my soul then protect it in the manner You do so with Your righteous servants"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Trusting in Allah before sleep",
            "reference": "Bukhari",
            "content": "O Allah, You created my soul and You will take its life, to You belongs its life and death. If You should keep my soul alive then protect it, and if You should take its life then forgive it. O Allah, I ask You for well-being"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "3",
            "description": "Seeking protection from the punishment of the grave",
            "reference": "Abu Dawud",
            "content": "O Allah, protect me from Your punishment on the day You resurrect Your servants"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Trusting in Allah",
            "reference": "Bukhari",
            "content": "In Your name, O Allah, I die and I live"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "33",
            "description": "Glorification before sleep",
            "reference": "Muslim",
            "content": "Glory be to Allah"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "33",
            "description": "Praise before sleep",
            "reference": "Muslim",
            "content": "All praise is for Allah"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "34",
            "description": "Magnification before sleep",
            "reference": "Muslim",
            "content": "Allah is the Greatest"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Ayat al-Kursi - Protection from Satan until morning",
            "reference": "Bukhari",
            "content": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "3",
            "description": "Reciting Surah Al-Ikhlas and the Mu'awwidhatan",
            "reference": "Abu Dawud",
            "content": "Say, He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "3",
            "description": "Reciting Surah Al-Ikhlas and the Mu'awwidhatan",
            "reference": "Abu Dawud",
            "content": "Say: I seek refuge in the Lord of daybreak, From the evil of that which He created, And from the evil of darkness when it settles, And from the evil of the blowers in knots, And from the evil of an envier when he envies"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "3",
            "description": "Reciting Surah Al-Ikhlas and the Mu'awwidhatan",
            "reference": "Abu Dawud",
            "content": "Say: I seek refuge in the Lord of mankind, The Sovereign of mankind, The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Dua for protection when going to sleep",
            "reference": "Muslim",
            "content": "O Allah, I submit my soul unto You, and I entrust my affair unto You, and I turn my face toward You, and I totally rely on You, in hope and fear of You. Verily there is no refuge nor safe haven from You except with You. I believe in Your Book which You have revealed and in Your Prophet whom You have sent"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "The last two verses of Surah Al-Baqarah - They will suffice him against all evil",
            "reference": "Bukhari",
            "content": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], We make no distinction between any of His messengers. And they say, We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination. Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Dua when fearing nightmares",
            "reference": "Abu Dawud & Tirmidhi",
            "content": "I seek refuge in the perfect words of Allah from His anger and punishment and from the evil of His servants, and from the whispers of the devils and from their presence"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "3",
            "description": "Seeking forgiveness before sleep",
            "reference": "Ahmad & Abu Dawud",
            "content": "I seek forgiveness from Allah, besides whom none has the right to be worshipped, the Ever Living, the Self-Subsisting, and I repent to Him"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Dua for good dreams",
            "reference": "Tirmidhi",
            "content": "O Allah, show me in my dreams what pleases me and brings me closer to You, and protect me from dreams that sadden or frighten me"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Comprehensive protection dua before sleep",
            "reference": "Abu Dawud",
            "content": "O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with Your greatness lest I be swallowed up by the earth"
        },
        {
            "category": "Azkar Before Sleep",
            "count": "1",
            "description": "Dua for surrendering to Allah before sleep",
            "reference": "Nasa'i",
            "content": "O Allah, I surrender my soul unto You, and I entrust my affair unto You, and I turn my face towards You, and I totally rely on You, in hope and fear of You. Verily there is no refuge nor safe haven from You except with You. I believe in Your Book which You have revealed and in Your Prophet whom You have sent"
        }
    ],
    "Azkar Upon Waking": [
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Praise upon waking",
            "reference": "Bukhari",
            "content": "All praise is for Allah who gave us life after causing us to die and unto Him is the resurrection"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Thanking Allah for well-being",
            "reference": "Abu Dawud",
            "content": "All praise is for Allah who restored to me my health and returned my soul and permitted me to remember Him"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Monotheism and seeking forgiveness upon waking",
            "reference": "Abu Dawud",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. Glory be to Allah, and praise be to Allah, and none has the right to be worshipped except Allah and Allah is the Greatest, and there is no might and no power except with Allah, the Most High, the Most Great. My Lord, forgive me"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Dua upon waking at night",
            "reference": "Bukhari",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. All praise is for Allah, and glory be to Allah, and none has the right to be worshipped except Allah, and Allah is the Greatest, and there is no might and no power except with Allah, then he said: O Allah, forgive me"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Dua for wiping sleep from the face",
            "reference": "Muslim",
            "content": "O Allah, the stars have disappeared, the eyes have slept, and You are Ever-Living, Self-Subsisting, neither slumber nor sleep overtakes You. O Ever-Living, O Self-Sustaining, grant me a peaceful night and put my eyes to sleep"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Upon seeing a good dream",
            "reference": "Muslim",
            "content": "All praise is for Allah Who has honored me with this good dream"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Comprehensive dua upon waking",
            "reference": "Abu Dawud & Nasa'i",
            "content": "All praise is for Allah who gave us life after causing us to die and granted us well-being in our bodies and returned our souls to us and permitted us to remember Him"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "When changing position during sleep",
            "reference": "Muslim",
            "content": "None has the right to be worshipped except Allah, alone, without any partner, to Him belongs all sovereignty and praise and He is over all things omnipotent"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Dua for waking in the last third of the night",
            "reference": "Bukhari & Muslim",
            "content": "O Allah, all praise is for You. You are the Sustainer of the heavens and the earth and whoever is in them. All praise is for You, You are the Sovereign of the heavens and the earth and whoever is in them. All praise is for You, You are the Light of the heavens and the earth and whoever is in them. All praise is for You, You are the Truth, and Your promise is true, and the meeting with You is true, and Your Word is true, and Paradise is true, and the Fire is true, and the prophets are true, and Muhammad (peace and blessings be upon him) is true, and the Hour is true. O Allah, unto You I have surrendered, and in You I have believed, and upon You I have relied, and to You I have turned in repentance, and over You I have disputed, and to You I have turned for judgment. So forgive me for what I have sent before me and what I have kept back, what I have concealed and what I have made public, and what You know of me more than I do. You are the One Who sends forth and You are the One Who delays. There is none worthy of worship except You"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "Dua upon waking with gratitude",
            "reference": "Tirmidhi",
            "content": "All praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself"
        },
        {
            "category": "Azkar Upon Waking",
            "count": "1",
            "description": "When fearing a disturbing dream",
            "reference": "Bukhari & Muslim",
            "content": "I seek refuge in Allah from Satan the accursed and from the evil of what I have seen"
        }
    ],
    "Quranic Duas": [
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "The most comprehensive dua from the Qur'an",
            "reference": "Qur'an 2:201",
            "content": "Our Lord, grant us good in this world and good in the Hereafter and protect us from the punishment of the Fire"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for patience and victory",
            "reference": "Qur'an 2:250",
            "content": "Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for forgiveness and mercy",
            "reference": "Qur'an 2:286",
            "content": "Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for guidance and mercy",
            "reference": "Qur'an 3:8",
            "content": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for forgiveness and protection from Fire",
            "reference": "Qur'an 3:16",
            "content": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for righteous offspring",
            "reference": "Qur'an 3:38",
            "content": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for knowledge",
            "reference": "Qur'an 20:114",
            "content": "My Lord, increase me in knowledge"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua of Prophet Yunus (Jonah)",
            "reference": "Qur'an 21:87",
            "content": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for righteous spouses and offspring",
            "reference": "Qur'an 25:74",
            "content": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for parents",
            "reference": "Qur'an 17:24",
            "content": "My Lord, have mercy upon them as they brought me up [when I was] small"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for increased faith",
            "reference": "Qur'an 23:109",
            "content": "Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for righteousness",
            "reference": "Qur'an 42:10",
            "content": "Our Lord, decide between us and our people in truth, and You are the best of those who give decision"
        },
        {
            "category": "Quranic Duas",
            "count": "1",
            "description": "Dua for escape from darkness",
            "reference": "Qur'an 6:63",
            "content": "Our Lord, remove us from this city of wrongdoing people and appoint for us from Yourself a protector and appoint for us from Yourself a helper"
        }
    ],
    "Prophets' Duas": [
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Adam (peace be upon him)",
            "reference": "Qur'an 7:23",
            "content": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Nuh (Noah) (peace be upon him)",
            "reference": "Qur'an 71:28",
            "content": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Ibrahim (Abraham) (peace be upon him)",
            "reference": "Qur'an 14:40-41",
            "content": "My Lord, make me an establisher of prayer and from my descendants. Our Lord, and accept my supplication. Our Lord, forgive me and my parents and the believers the Day the account is established"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Musa (Moses) (peace be upon him)",
            "reference": "Qur'an 20:25-28",
            "content": "My Lord, expand for me my breast and ease for me my task and untie the knot from my tongue that they may understand my speech"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Ayyub (Job) (peace be upon him)",
            "reference": "Qur'an 21:83",
            "content": "Indeed, adversity has touched me, and You are the Most Merciful of the merciful"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Sulayman (Solomon) (peace be upon him)",
            "reference": "Qur'an 27:19",
            "content": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Zakariyya (Zechariah) (peace be upon him)",
            "reference": "Qur'an 3:38",
            "content": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Yusuf (Joseph) (peace be upon him)",
            "reference": "Qur'an 12:101",
            "content": "My Lord, You have given me [something] of sovereignty and taught me of the interpretation of dreams. Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Al-Khidr (peace be upon him)",
            "reference": "Qur'an 18:10",
            "content": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Isma'il (Ishmael) (peace be upon him)",
            "reference": "Qur'an 2:127",
            "content": "Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing"
        },
        {
            "category": "Prophets' Duas",
            "count": "1",
            "description": "Dua of Prophet Harun (Aaron) (peace be upon him)",
            "reference": "Qur'an 20:29-32",
            "content": "My Lord, expand for me my breast and ease for me my task and untie the knot from my tongue that they may understand my speech"
        }
    ],
    "Dua Khatm al-Quran": [
        {
            "category": "Dua Khatm al-Quran",
            "count": "1",
            "description": "The supplication recited upon completing the Quran.",
            "content": "O Allah, have mercy on me through the Quran, and make it for me a guide, a light, a source of guidance, and a mercy. O Allah, remind me of what I have forgotten from it, teach me what I am ignorant of, and grant me its recitation during the hours of the night and at the ends of the day, and make it an argument in my favor, O Lord of the worlds. O Allah, rectify for me my religion which is the safeguard of my affairs, and rectify for me my worldly life in which is my livelihood, and rectify for me my Hereafter to which is my return, and make life an increase for me in every good, and make death a relief for me from every evil. O Allah, make the best part of my life its end, the best of my deeds the last, and the best of my days the day I meet You. O Allah, I ask You for a pleasant life, a peaceful death, and a return that is neither disgraceful nor shameful. O Allah, I ask You for the best of requests, the best of supplications, the best of success, the best of deeds, the best of rewards, the best of life, and the best of death. Make me firm, make my scales heavy, fulfill my faith, raise my rank, accept my prayers, forgive my mistakes, and I ask You for the highest ranks in Paradise. O Allah, I ask You for the causes of Your mercy, the means of Your forgiveness, safety from every sin, the gain from every good, success in attaining Paradise, and salvation from the Fire. O Allah, make the outcome of all our affairs good, and save us from the disgrace of this world and the punishment of the Hereafter. O Allah, grant us, from Your fear, that which will keep us from disobeying You, and from Your obedience that which will bring us to Your Paradise, and from certainty that which will make the calamities of this world easy for us. Let us enjoy our hearing, our sight, and our strength as long as You keep us alive, and make it the inheritor from us. Let our revenge be upon those who wrong us, and help us against those who are hostile to us. Do not make our calamity in our religion, do not make this world our greatest concern nor the limit of our knowledge, and do not give power over us to those who will not have mercy on us. O Allah, do not leave for us a sin except that You forgive it, nor a worry except that You relieve it, nor a debt except that You pay it, nor a need from the needs of this world or the Hereafter except that You fulfill it, O Most Merciful of the merciful. Our Lord, accept from us, indeed You are the All-Hearing, the All-Knowing. And turn to us in mercy, indeed You are the Oft-Returning, Most Merciful. And may Allah send blessings and peace upon our Prophet Muhammad and upon his family and companions in abundance."
        }
    ]
}